//
// Created by Иван Черемисенов on 07.02.2023.
//

/*
 * Две темы:
 * 1) Введение в c++
 * Стандарт C++98
 *
 * 2) Формальные грамматики
 *
 * Вторник 758 - практикум
 * Среда 642 - семинар
 *
 * moodle.cs.msu.ru
 * Базовый C++
 * Столяров -- Парадигмы программирования
 * Карпов, Волкова, че-то там про C++ (читать перед экзаменом или если знаешь C++)
 *
 * ---------------------------------------------------------------------------------------------------
 *
 * До этого:
 * Процедурная / императивная парадигма программирования
 *
 * Сейчас:
 * Объектно-ориентированная парадигма
 * Парадигма абстрактных типов данных
 * Исключения
 *
 * Отличия С и C++:
 * 
 */

#include <iostream>

int main() {
	std::cout << "Lesson 1" << std::endl;
	return 0;
}